Tekla.Structures.Model.RebarSplitter.LapTypeEnum
The lap type.

Tekla.Structures.Model.RebarSplitter.LapTypeEnum.OFFSET_WHOLE_BAR
Offset whole reinforcing bar.

Tekla.Structures.Model.RebarSplitter.LapTypeEnum.OFFSET_BAR_END
Offset just the reinforcing bar split end.